Revit 2027 API
ImagePlacementOptions(XYZ, BoxPlacement) Constructor
 Constructs a new ImagePlacementOptions for placing an ImageInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImagePlacementOptions(
	XYZ location,
	BoxPlacement placementPoint
)
Public Sub New (
	location As XYZ,
	placementPoint As BoxPlacement
)
public:
ImagePlacementOptions(
	XYZ^ location,
	BoxPlacement placementPoint
)
new :
        location : XYZ *
        placementPoint : BoxPlacement -> ImagePlacementOptions
Parameters
location XYZ
 The location where the image will be placed
placementPoint BoxPlacement
 The point of the image that will be aligned to the location in the view
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ImagePlacementOptions Class
ImagePlacementOptions Overload
Autodesk.Revit.DB Namespace